Feature: ورود کاربر به پلتفرم کوروک توسط هوش مصنوعی

  Scenario: ورود موفقیت‌آمیز کاربر
    Given کاربر وارد پلتفرم کوروک به آدرس "https://sandbox.kowork.work" می‌شود
    When کاربر روی دکمه "ورود/ثبت نام" کلیک می‌کند
    And کاربر شماره تلفن "................." را وارد فیلد شماره تلفن می‌کند
    And کاربر روی دکمه "ادامه" کلیک می‌کند
    And کاربر روی دکمه "ورود به وسیله رمز عبور" کلیک می‌کند
    And کاربر رمز عبور "................." را وارد فیلد رمز عبور می‌کند
    And کاربر روی دکمه "ورود به حساب کاربری" کلیک می‌کند
    Then کاربر باید به صفحه پروفایل خود در آدرس "https://sandbox.kowork.work/profile" منتقل شود


