Feature: ایجاد یک سفارش کار جدید

  Scenario: ایجاد موفقیت‌آمیز یک سفارش کار جدید
    Given کاربر وارد حساب کاربری خود شده و در صفحه پروفایل به آدرس "https://sandbox.kowork.work/profile" قرار دارد
    When کاربر روی دکمه "ایجاد سفارش کار" کلیک می‌کند.
    Then کاربر وارد صفحه انتخاب شیوه ایجاد سفارش جدید میشود.
    And کاربر گزینه "ثبت سفارش کار با کمک AI" را انتخاب می‌کند.


    Scenario Outline:
      When کاربر قبلا یک سفارش تکمیل نشده ثبت کرده باشد،
      Then وارد صفحه دیگری برای انتخاب بین ادامه سفارش فبلی و یا ایجاد سفارش جدید خواهد شد.
      
      
  Scenario:
    And در این حالت کاربر روی کلید "دوباره سفارش کار ثبت میکنم کلیک می‌کند.
    And کاربر در فیلد مربوط به نام کسب و کار عبارت "انبوه سازان پارس" را وارد می کند. 


    Scenario Outline:
      When چنانچه کاربر فیلد نام کسب و کار را به صورت خالی رها کند,
      then باید پیام خطای  "این فیلد الزامی است" را در ذیل فیلد مربوطه  مشاهده کند.

  Scenario:
    And کاربر در فیلد مربوط به حوزه فعالیت کسب و کار گزینه "مارکتینگ" را انتخاب می کند.
    And کاربر در فیلد مربوط به توصیف سفارش عبارت "طراحی لوگو برای شرکت ساختمانی" را وارد می کند.
    When کاربر روی کلید "مرحله بعد" کلیک می کند.


    Scenario Outline:
      When چنانچه کاربر فیلد توصیف سفارش را به صورت خالی رها کند.
      Then ادامه فرآیند متوقف شده و کاربر با پیام خطای "لطفا شرح سفارش کار را تکمیل کنید" مواجه شود.


  Scenario:
    Given کاربر در فیلد مربوط به موضوع سفارش باید با عبارتی مواجه شود که کلمات طراحی، لوگو و انبوه سازان پارس را دارا باشد.
    And کاربر در فیلد مربوط به دسته بندی سفارش باید گزینه انتخاب شده "طراحی گرافیک و بصری" را مشاهده کند.
    And کاربر در فیلد مربوط به زیر دسته سفارش باید گزینه انتخاب شده "طراحی لوگو" را مشاهده کند.
    Then کاربر روی کلید "مرحله بعد" کلیک می کند.
    And هوش مصنوعی سایت شروع به تولید متن بریف سفارش کار می کند,
    When پس از تکمیل بریف،
    Then کاربر یک متن درباره سفارش کار ثبت شده با حداقل 1000 کاراکتر  را مشاهده می کند. 
    When کاربر روی کلید "مرحله بعد" کلیک می کند.
    And کاربر با کلیک روی کلید "ارسال فایل" یک فایل تصویری دلخواه با فرمت تصویری jpg انتخاب می‌کند
    And منتظر می ماند تا آپلود آن به اتمام برسد.
    Then کاربر روی کلید "مرحله بعد" کلیک می کند.
    And کاربر در بخش بودجه و زمان بندی با انجام پروژه را در مقادیر پیش فرض خود رها کرد
    Then روی کلید "مرحله بعد" کلیک می کند.
    Given کاربر اطلاعات مربوط به پروژه خود را مشاهده می کند.
    And مطمئن می شود که فایل الحاقی ارسال شده قبلی در این بخش وجود داشته.
    And عنوان پروژه با اطلاعات وارد شده در طی آزمون تطابق داشته باشد.
    And کاربر روی کلید "ارسال و جستجوی متخصص" کلیک می کند.
    And کاربر روی کلید "فهمیدم" کلیک می کند.
    Then کاربر مجددا به صفحه ایجاد سفارش بازگشته و پیام ثبت موفقیت آمیز ثبت پروژه را مشاهده می کند.
    Given کاربر به پروفایل خود در آدرس https://sandbox.kowork.work/profile باز می گردد.
    Then کاربر در اولین سطر از لیست سفارشات خود باید عنوان "طراحی لوگو برای انبوه سازان پارس" را مشاهده کند
