Feature: ورود به حساب کاربری در پلتفرم کوروک

  Scenario: ورود موفق با استفاده از شماره تلفن و رمز عبور
    Given کاربر وارد پلتفرم ثبتنام یا ورود کوروک به آدرس "https://sandbox.kowork.work/login-register"
    when کاربر در فیلد مربوط به شماره تلفن عبارت "............" را وارد می کند
    when کاربر روی کلید "ادامه" کلیک می کند
    when کاربر وارد صفحه کد تایید پیامکی شده و روی کلید "ورود به وسیله رمز عبور" کلیک می کند
    when کاربر در فیلد مربوط به رمز عبور عبارت "............" را وارد می کند
    when کاربر روی کلید "ورود به حساب کاربری" کلیک می کند
    Then کاربر با موفقیت وارد شده و به پروفایل خود به آدرس "https://sandbox.kowork.work/profile" منتقل می شود
